In [1]:
import pandas as pd
import numpy as np

# data visualization
import matplotlib.pyplot  as plt 
import seaborn as sns

# impoerting and reading sql file
import pyodbc
from dotenv import dotenv_values

# cancelling warning messages
import warnings
warnings.filterwarnings("ignore")

In [2]:
# create dotenv environment
environment_variables = dotenv_values()

# get varriable from .env created
server = environment_variables.get("SERVER")
database = environment_variables.get("DATABASE")
username = environment_variables.get("USERNAME")
password =environment_variables.get("PASSWORD")

In [3]:
# create  connections to the server using sever name, username, database and password
conn_str = f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

In [4]:
connection = pyodbc.connect(conn_str)

In [5]:
query = "SELECT * From dbo.oil"

data_oil = pd.read_sql(query,connection)

data_oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02   93.139999
2     2013-01-03   92.970001
3     2013-01-04   93.120003
4     2013-01-07   93.199997
...          ...         ...
1213  2017-08-25   47.650002
1214  2017-08-28   46.400002
1215  2017-08-29   46.459999
1216  2017-08-30   45.959999
1217  2017-08-31   47.259998

[1218 rows x 2 columns]

In [10]:
data_oil.to_csv('oil_data.csv')

In [11]:
oil_df= pd.read_csv("oil_data.csv")
oil_df

      Unnamed: 0        date  dcoilwtico
0              0  2013-01-01         NaN
1              1  2013-01-02   93.139999
2              2  2013-01-03   92.970001
3              3  2013-01-04   93.120003
4              4  2013-01-07   93.199997
...          ...         ...         ...
1213        1213  2017-08-25   47.650002
1214        1214  2017-08-28   46.400002
1215        1215  2017-08-29   46.459999
1216        1216  2017-08-30   45.959999
1217        1217  2017-08-31   47.259998

[1218 rows x 3 columns]

In [7]:
query2= "SELECT * from dbo.holidays_events"
data_holiday=pd.read_sql(query2,connection)
data_holiday

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False
...,...,...,...,...,...,...
345,2017-12-22,Additional,National,Ecuador,Navidad-3,False
346,2017-12-23,Additional,National,Ecuador,Navidad-2,False
347,2017-12-24,Additional,National,Ecuador,Navidad-1,False
348,2017-12-25,Holiday,National,Ecuador,Navidad,False
349,2017-12-26,Additional,National,Ecuador,Navidad+1,False

In [12]:
data_holiday.to_csv("holiday_data.csv")

In [13]:
holiday_df = pd.read_csv('holiday_data.csv')
holiday_df

,Unnamed: 0,date,type,locale,locale_name,description,transferred
0,0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False
...,...,...,...,...,...,...,...
345,345,2017-12-22,Additional,National,Ecuador,Navidad-3,False
346,346,2017-12-23,Additional,National,Ecuador,Navidad-2,False
347,347,2017-12-24,Additional,National,Ecuador,Navidad-1,False
348,348,2017-12-25,Holiday,National,Ecuador,Navidad,False
349,349,2017-12-26,Additional,National,Ecuador,Navidad+1,False

In [15]:
query3= "SELECT * from dbo.stores"
data_stores=pd.read_sql(query3,connection)
data_stores.head(2)

   store_nbr   city      state type  cluster
0          1  Quito  Pichincha    D       13
1          2  Quito  Pichincha    D       13

In [16]:
data_stores.to_csv("stores_data.csv")

In [18]:
stores_df = pd.read_csv("stores_data.csv")
stores_df

,Unnamed: 0,store_nbr,city,state,type,cluster
0,0,1,Quito,Pichincha,D,13
1,1,2,Quito,Pichincha,D,13
2,2,3,Quito,Pichincha,D,8
3,3,4,Quito,Pichincha,D,9
4,4,5,Santo Domingo,Santo Domingo de los Tsachilas,D,4
5,5,6,Quito,Pichincha,D,13
6,6,7,Quito,Pichincha,D,8
7,7,8,Quito,Pichincha,D,8
8,8,9,Quito,Pichincha,B,6
9,9,10,Quito,Pichincha,C,15
10,10,11,Cayambe,Pichincha,B,6
11,11,12,Latacunga,Cotopaxi,C,15
12,12,13,Latacunga,Cotopaxi,C,15
13,13,14,Riobamba,Chimborazo,C,7
14,14,15,Ibarra,Imbabura,C,15
15,15,16,Santo Domingo,Santo Domingo de los Tsachilas,C,3
16,16,17,Quito,Pichincha,C,12
17,17,18,Quito,Pichincha,B,16
18,18,19,Guaranda,Bolivar,C,15
19,19,20,Quito,Pichincha,B,6
20,20,21,Santo Domingo,Santo Domingo de los Tsachilas,B,6
21,21,22,Puyo,Pastaza,C,7
22,22,23,Ambato,Tungurahua,D,9
23,23,24,Guayaquil,Guayas,D,1
24,24,25,Salinas,Santa Elena,D,1
25,25,26,Guayaquil,Guayas,D,10
26,26,27,Daule,Guayas,D,1
27,27,28,Guayaquil,Guayas,E,10
28,28,29,Guayaquil,Guayas,E,10
29,29,30,Guayaquil,Guayas,C,3
30,30,31,Babahoyo,Los Rios,B,10
31,31,32,Guayaquil,Guayas,C,3
32,32,33,Quevedo,Los Rios,C,3
33,33,34,Guayaquil,Guayas,B,6
34,34,35,Playas,Guayas,C,3
35,35,36,Libertad,Guayas,E,10
36,36,37,Cuenca,Azuay,D,2
37,37,38,Loja,Loja,D,4
38,38,39,Cuenca,Azuay,B,6
39,39,40,Machala,El Oro,C,3
40,40,41,Machala,El Oro,D,4
41,41,42,Cuenca,Azuay,D,2
42,42,43,Esmeraldas,Esmeraldas,E,10
43,43,44,Quito,Pichincha,A,5
44,44,45,Quito,Pichincha,A,11
45,45,46,Quito,Pichincha,A,14
46,46,47,Quito,Pichincha,A,14
47,47,48,Quito,Pichincha,A,14
48,48,49,Quito,Pichincha,A,11
49,49,50,Ambato,Tungurahua,A,14
50,50,51,Guayaquil,Guayas,A,17
51,51,52,Manta,Manabi,A,11
52,52,53,Manta,Manabi,D,13
53,53,54,El Carmen,Manabi,C,3

In [31]:
data_stores["city"].unique()

array(['Quito', 'Santo Domingo', 'Cayambe', 'Latacunga', 'Riobamba',
       'Ibarra', 'Guaranda', 'Puyo', 'Ambato', 'Guayaquil', 'Salinas',
       'Daule', 'Babahoyo', 'Quevedo', 'Playas', 'Libertad', 'Cuenca',
       'Loja', 'Machala', 'Esmeraldas', 'Manta', 'El Carmen'],
      dtype=object)

In [35]:
data_holiday["locale_name"].unique()

array(['Manta', 'Cotopaxi', 'Cuenca', 'Libertad', 'Riobamba', 'Puyo',
       'Guaranda', 'Imbabura', 'Latacunga', 'Machala', 'Santo Domingo',
       'El Carmen', 'Cayambe', 'Esmeraldas', 'Ecuador', 'Ambato',
       'Ibarra', 'Quevedo', 'Santo Domingo de los Tsachilas',
       'Santa Elena', 'Quito', 'Loja', 'Salinas', 'Guayaquil'],
      dtype=object)

In [32]:
data_stores["state"].unique()

array(['Pichincha', 'Santo Domingo de los Tsachilas', 'Cotopaxi',
       'Chimborazo', 'Imbabura', 'Bolivar', 'Pastaza', 'Tungurahua',
       'Guayas', 'Santa Elena', 'Los Rios', 'Azuay', 'Loja', 'El Oro',
       'Esmeraldas', 'Manabi'], dtype=object)

Check the info of the data base

In [14]:
data_oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [15]:
data_holiday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB

In [16]:
data_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

check the shape of the data

In [17]:
data_oil.shape

(1218, 2)

In [18]:
data_holiday.shape

(350, 6)

In [19]:
data_stores.shape

(54, 5)

In [20]:
data_oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [21]:
data_holiday.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [22]:
data_stores.isna().sum()

store_nbr    0
city         0
state        0
type         0
cluster      0
dtype: int64

In [34]:
test_data = pd.read_csv("test.csv")
test_data

            id        date  store_nbr                      family  onpromotion
0      3000888  2017-08-16          1                  AUTOMOTIVE            0
1      3000889  2017-08-16          1                   BABY CARE            0
2      3000890  2017-08-16          1                      BEAUTY            2
3      3000891  2017-08-16          1                   BEVERAGES           20
4      3000892  2017-08-16          1                       BOOKS            0
...        ...         ...        ...                         ...          ...
28507  3029395  2017-08-31          9                     POULTRY            1
28508  3029396  2017-08-31          9              PREPARED FOODS            0
28509  3029397  2017-08-31          9                     PRODUCE            1
28510  3029398  2017-08-31          9  SCHOOL AND OFFICE SUPPLIES            9
28511  3029399  2017-08-31          9                     SEAFOOD            0

[28512 rows x 5 columns]

In [48]:
train_data = pd.read_csv("train.csv")
train_data

,id,date,store_nbr,family,sales,onpromotion
0,0,2013-01-01,1,AUTOMOTIVE,0.000,0
1,1,2013-01-01,1,BABY CARE,0.000,0
2,2,2013-01-01,1,BEAUTY,0.000,0
3,3,2013-01-01,1,BEVERAGES,0.000,0
4,4,2013-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [42]:
sample_data = pd.read_csv("sample_submission.csv")
sample_data

            id  sales
0      3000888    0.0
1      3000889    0.0
2      3000890    0.0
3      3000891    0.0
4      3000892    0.0
...        ...    ...
28507  3029395    0.0
28508  3029396    0.0
28509  3029397    0.0
28510  3029398    0.0
28511  3029399    0.0

[28512 rows x 2 columns]

In [43]:
sample_data["sales"].unique()

array([0.])

In [24]:
transactions = pd.read_csv("transactions.csv")
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]